// ==================================================
// PImage Array
// 图片数组 = 固定的图片柜子
// ==================================================

PImage[] images = new PImage[3];


// ==================================================
// ArrayList
// 会伸缩的大盒子
// 装很多 ImageFragment Object
// ==================================================

ArrayList<ImageFragment> fragments;



void setup() {

  size(800, 600);

  imageMode(CENTER);


  // ==================================================
  // 把三张图片装进 Array
  // ==================================================

  images[0] = loadImage("test01.png");
  images[1] = loadImage("test02.jpg");
  images[2] = loadImage("test03.png");


  // ==================================================
  // 创建装 Object 的 ArrayList
  // ==================================================

  fragments = new ArrayList<ImageFragment>();


  // ==================================================
  // 创建 20 个独立 ImageFragment Object
  // ==================================================

  for (int i = 0; i < 20; i++) {

    // ------------------------------------------
    // 从 0、1、2 中随机选一个编号
    // ------------------------------------------

    int randomIndex =
      int(random(images.length));


    // ------------------------------------------
    // 根据编号，从图片 Array 里拿一张图片
    // ------------------------------------------

    PImage selectedImage =
      images[randomIndex];


    // ------------------------------------------
    // 把选中的图片交给新 Object
    // ------------------------------------------

    fragments.add(
      new ImageFragment(
        selectedImage,
        random(width),
        random(height)
      )
    );
  }
}



void draw() {

  background(0);


  // ==================================================
  // 逐个处理所有 ImageFragment
  // ==================================================

  for (int i = 0; i < fragments.size(); i++) {

    ImageFragment fragment =
      fragments.get(i);

    fragment.update();
    fragment.display();
  }
}



// ==================================================
// Class
// ImageFragment = 图像碎片的模具
// ==================================================

class ImageFragment {


  // ==================================================
  // State / 状态
  // ==================================================


  // ------------------------------------------
  // 每个 Object 自己携带的图片
  // ------------------------------------------

  PImage imageData;


  // ------------------------------------------
  // 位置
  // ------------------------------------------

  float x;
  float y;


  // ------------------------------------------
  // 大小
  // ------------------------------------------

  float w;
  float h;


  // ------------------------------------------
  // 速度
  // ------------------------------------------

  float speedX;
  float speedY;



  // ==================================================
  // Constructor
  // 构造函数 / 出生设置
  // ==================================================

  ImageFragment(
    PImage startImage,
    float startX,
    float startY
  ) {

    // ------------------------------------------
    // 保存自己出生时获得的图片
    // ------------------------------------------

    imageData = startImage;


    // 位置
    x = startX;
    y = startY;


    // 大小
   w = random(80, 180);

// 保持原图片的宽高比例
   float ratio = (float) imageData.height / imageData.width;
   h = w * ratio;

    // 速度
    speedX = random(-0.5, 0.5);
    speedY = random(-0.5, 0.5);
  }



  // ==================================================
  // Method
  // Update / 更新
  // ==================================================

  void update() {

    x += speedX;
    y += speedY;
  }



  // ==================================================
  // Method
  // Display / 显示
  // ==================================================

  void display() {

    image(
      imageData,
      x,
      y,
      w,
      h
    );
  }
}
